/*нарисуй ромб

         1
        121
       12321
      1234321
     123454321
    12345654321
   1234567654321
  123456787654321
 12345678987654321
1234567890987654321
 12345678987654321
  123456787654321
   1234567654321
    12345654321
     123454321
      1234321
       12321
        121
         1
*/

let n=10
let str = ""
for (i=1; i<=n; i++) {
    str = ' '.repeat(n-i)
    for (j=1; j<=i; j++){
        str += j %10
    }
    for(k=i-1; k>=1; k--){
        str += k
    }
    console.log(str)
   // str += "\n"
}
for (i=1; i<=n; i++) {
    str = ' '.repeat(n-(n-i))
    for (j=1; j<=n-i; j++){
        str += j
    }
    for(k=n-i-1; k>=1; k--){
        str += k
    }
    console.log(str)
   // str += "\n"
}
//console.log(str)